{"format": "graph-model", "modelTopology": {"node": [{"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "16"}]}}}}, {"name": "step_size", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "fire_rate", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "angle", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {}}}}, {"name": "strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAABAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["x", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"begin_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, {"name": "MaxPool2d", "op": "MaxPool", "input": ["strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "3", "3", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "Greater/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}, "floatVal": [0.1]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Greater", "op": "Greater", "input": ["MaxPool2d", "Greater/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_0", "op": "Identity", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1/values_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAAAAgD8AAAAAAAAAAAAAAAAAAAAA"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/input/_1", "op": "Identity", "input": ["angle"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Cos", "op": "Cos", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Sin", "op": "Sin", "input": ["Func/PartitionedCall/input/_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_1", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/sub", "op": "Sub", "input": ["PartitionedCall/mul", "PartitionedCall/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAAAAAAAA+AACAvgAAAAAAAIA+AAAAvgAAAAAAAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Mul", "input": ["PartitionedCall/Sin", "PartitionedCall/mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}]}, "tensorContent": "AAAAvgAAgL4AAAC+AAAAAAAAAAAAAAAAAAAAPgAAgD4AAAA+"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_3", "op": "Mul", "input": ["PartitionedCall/Cos", "PartitionedCall/mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/mul_2", "PartitionedCall/mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/stack_1", "op": "Pack", "input": ["PartitionedCall/stack_1/values_0", "PartitionedCall/sub", "PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}, "axis": {"i": "-1"}, "N": {"i": "3"}}}, {"name": "PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AAAAAAAAAAAAAAAAAAAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AQAAAAEAAAABAAAAAQAAAA=="}}}}, {"name": "PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/stack_1", "PartitionedCall/strided_slice/stack", "PartitionedCall/strided_slice/stack_1", "PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "11"}, "new_axis_mask": {"i": "4"}, "end_mask": {"i": "11"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/ExpandDims", "op": "ExpandDims", "input": ["PartitionedCall/strided_slice", "PartitionedCall/Repeat/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/repeats", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [16]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Cast", "op": "Cast", "input": ["PartitionedCall/Repeat/repeats"], "attr": {"SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape/shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape", "op": "Reshape", "input": ["PartitionedCall/Repeat/Cast", "PartitionedCall/Repeat/Reshape/shape_1"], "attr": {"T": {"type": "DT_INT32"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples/4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Tile/multiples", "op": "Pack", "input": ["PartitionedCall/Repeat/Tile/multiples/0", "PartitionedCall/Repeat/Tile/multiples/1", "PartitionedCall/Repeat/Tile/multiples/2", "PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/Tile/multiples/4"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "5"}}}, {"name": "PartitionedCall/Repeat/Tile", "op": "Tile", "input": ["PartitionedCall/Repeat/ExpandDims", "PartitionedCall/Repeat/Tile/multiples"], "attr": {"Tmultiples": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Repeat/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}, "tensorContent": "AwAAAAMAAAABAAAAAwAAAA=="}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice/stack", "PartitionedCall/Repeat/strided_slice/stack_1", "PartitionedCall/Repeat/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [2]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}}}, {"name": "PartitionedCall/Repeat/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_1/stack", "PartitionedCall/Repeat/strided_slice_1/stack_1", "PartitionedCall/Repeat/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/mul", "op": "Mul", "input": ["PartitionedCall/Repeat/Reshape", "PartitionedCall/Repeat/strided_slice_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/values_1", "op": "Pack", "input": ["PartitionedCall/Repeat/mul"], "attr": {"axis": {"i": "0"}, "N": {"i": "1"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [3]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}, "intVal": [1]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/strided_slice_2", "op": "StridedSlice", "input": ["PartitionedCall/Repeat/Shape", "PartitionedCall/Repeat/strided_slice_2/stack", "PartitionedCall/Repeat/strided_slice_2/stack_1", "PartitionedCall/Repeat/strided_slice_2/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}, "intVal": [0]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/concat", "op": "ConcatV2", "input": ["PartitionedCall/Repeat/strided_slice", "PartitionedCall/Repeat/concat/values_1", "PartitionedCall/Repeat/strided_slice_2", "PartitionedCall/Repeat/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/Repeat/Reshape_1", "op": "Reshape", "input": ["PartitionedCall/Repeat/Tile", "PartitionedCall/Repeat/concat"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/depthwise", "op": "DepthwiseConv2dNative", "input": ["Func/PartitionedCall/input/_0", "PartitionedCall/Repeat/Reshape_1"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "PartitionedCall/Identity", "op": "Identity", "input": ["PartitionedCall/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/PartitionedCall/output/_2", "op": "Identity", "input": ["PartitionedCall/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "128"}]}, "tensorContent": "jlFpvm4cjD72/P+8NKbtvRJuxbzDTCa9gxIOPpOHtjwQdFi+FEcmvng9GD6tqVC9m7d6vi5hlb7QOWk+5Ow0vmd8N742KZ+9yKSavGqhHz7S0yq+TbEhvWLb3TzZviq8QldEPudcWr76cxc+ysyZvAUgB743R4o8R2kyvoAHdz0FMx6+iqRdvnItAj6a6ru+5FtdvN9leD18+vs95UuCvkr2g7wEHLg6IO8Kvc8zo71TiJg9BwBRvZPaI71dtsc9FkXSPQ3sIL6HsjW+PtcmvcvVlr6HYm8+1021vty367yE94m+xRX7PIv9Cj4n0l09o6/hvezYoT1DiA0+ILiZPeQscz4uuvi9iqI/PRqljr0nTew8unskPjPJMb7WhuA9V++EPdsKEz51dF+9Z+q9O33yLr67fwu+Q/S1vrLNND3waQo9D4HWvVtULj6MDkg9ecsFO2TH+TycugA9adazvjWtcD6aLQQ+KvxjPbKEDz2MrBI+/eJwvlyz7L3b3zE90WADvkrpjD4Vxqm+z80ZuzYg0T2H7xi+OS59vtl0Wz2nn7u9QdzYvQESjD5WUsA8vb0tvlK1zj3s6Q+9W9cjO4IMcr0+pwK9WvI4vUIMgb67xD4+VlSRvYVIhj1QPmK+fU/Yvsq4jL4hyQ6+WE8cvVZ9Jr7VmDi9x/R/vh4F+L62Xiq+Z+82vrIcLT0TKkO9Sq18vt7zyD0xxQU+gm4XPcFJkjy2KxW+h+ITvcaDLT5px5I+BQz1vQeL+D2evSQ+s1obPu58Cb6003E9lpmavRnlnjzXv329nPmoPeJKi75MX4q9mf3AvYMChj2iPJU9uxqbPVgXRT6zqFs+O4FTPSL99Lxwu5U9aYnVPo+FlLxEkUC7XjW2vWyzOb7+4zc+ZnABPaGb0Ty+f7q7VEtqvu70Jr6G/B0+0Zm8vIYenz0Xvhu8ksgMvjKS6b2jUHE8LPWCvjBymz3C6lS+tCrUvD57F76NqjQ+8Vapvv9DRT2MGCK+yHmvvDzpx77019q7DkEOvi5kC7513yG+vjHDvgV+6jywyTK+O3Y2vhQBVz5aHQK+GYP1vm83KL2tMrW9GVGQOyf96T38YZm8JoSqO7HBbb65mJS9mbd9vmU2sj289B6+ad+5PShI0j1ggVo+7nGDPDUGLj4bLKG9JWhwvuKVoL71IXi+yEUDPXZTYrxz+EC+unCDvkYyez32+f89pvzqO63coT0OwUe+Moqivmf2G74KdYA9xh9pvZJ6tDtNCvC8uIsGPfxbxL1k6kC+gKJCvglmK77JN1u+QWT/PcEcUL6hQQi+BgLsPf2Lc737mQK9CGyZPo4oFb70zwu/B7xoPuhhdT4d6Kq+cHn6valozbv/YEI9LDb4vifF0jym74U+vp0hvhhhL75lQgi+0ulFPpKaUD6oHJw+NPUjviEahD5DThC+mtulPo7Xcb3L/mu+UgSUvL0kNL7C/oy96wA8vdASJL74AH0+p5W4vXXNTT5Orgk9Twc+PfDTjL4gCdc+oCIVvlA2sD5Rt5G+Xv5GvgRI7T2Om9w9NNEsPuQIQr7A/0u9o7AbPNN11D2ms8U9l8VRvmARCT9kkCM+vpm+PTFA5b7IKZs9XvcCvruha75oKoU+X+8qvtnHED6gG5Q8r48oPpMYYT1S9AU+1QEsvt8/iz5+sh6+x/GGvptdoLx1M1G9kVQwvmqzYT3aYe4+6WmLPDGvQz5i854+H8mxvrA7Br1ouGk9hzY6viiTez7ROIu9MhSLPVuq8D6aQgk+yWUNPdcAJzy8Gtm9OIm5vnfU8z67UQO/Qn7HvbZJ27qvOpS9G0D7vZ0TNz5Uwrc82tu5PkGMEz3Xuee8rjeAPS0aTj1P4Aq+9oV/PKjeYD7TnDg+ZqhMvlfAAz5lxR2+CddQvfNxkD4L3UW+XfsPPQ+Pl7xojIa+/UUXPip9Mj1vhcw+xE8Pvd2pJL3e1Vk+0w+pPjezLL7VtA69DM0wPQuIhz3eLq6+tKkcvs1Dqb5NZZs+UchtPnDNAT+a3PI+YxLnPhf2ET1uwlU+G7P4PfAKsL5ZeDW+oUuKPHkcgb4ttZI90HkPPvIweb0w2sU7JaNzvN0AEL5u3Tg+038dPh/giT7KHji9f4pPvSNvAb2jcIu8WfCXPazRPL7cG0Q919uaPTEykbzJngm+/JkNvgAtDL4QKda+fAu0vORlqD20aUi+YA+dvvkV3byp9cs9s7J8vkqyqD6L6Fm+7R2ivkFjV760ELO9vP5dvjWXCr6J4/c9f8gTPs6q5D31jIa+bdouvkmmtzw/p5g+gjS7vCsBNb65AKQ71F4gvvI9Nr0HvWA+3g1vvl7iCj6XsR0+AoUlPozUYT0x2x89MnDDvQrHb75NObW9EwI1vQJQD760IuK+D8zWPPFAL77LUdk9az3jPVT68L14CAG9kBJgvbhpUb0YtlS+XaUtvVLx8T28wA6+0seavQ63br4EhAE+uLhrvZDBLb6gXE++G5Y7PiTNJ75t8mW9sRRnPkXRfD4Ef/M9EM78PUA65j16DkQ9ZvA2vc/hiDwkRom+9fbQPfXCFj4+TUi9HqN7vv81G75qh10+Fgx4vioVQr3CRIA+uEKJvZRebD7Jwdy9rGlVviB9Tr5is3G9STBMvaRjWT4c+BM9Z/xXPX5thz2of5C6YydiPIBrJb1/aLg95SlkvkFtd75xfau+vlsnPQKX+T1po7G9yoZivrncyT3Vp8a9lUQ/vgwp1j4aczY95rBTvvhvOz42LZA9IqcHvMvggr77kRu+mbYUviFTsL4YMQO+uzXuvmPoxj3iypE9/fO0PKpNjz0SdIC+XPKqPqrjgr5zPiA9UDO7PWTOHL5Ir1y9Mj/PPf2WQb3iTh2++Lv4t5oM4b3Mxr8+FofWvdi8nL0H2gy+JEKVPOa0Hz2jqhC9v4Ycvn0ZgLwGbHK9qr8pPkarlT0DX9m+s0dDvjjNTb4oOgy+URgGvn1v4D6pQ549Evl5Pp+CyT2esQe+u5iPvjtZNL3fpXo9aOQDvnRFpL4LYss7dzJOvmLPSD4oRy090a/vvVRxij0jsGY8gJ+OvQgVBL6K2Qo9W0r2vf6zhb41t1W+wE4WPvDo5j1tAuI9/a5BvuBvv7ypD0q+qX3QvavGuLy1w+s8fLVBPJkDcT3yXt09IlbNvRCxRD5D6FK9x60PPV43Pj38+g6+URwxPmB8UT6CZBC+7csOvlmRR70ZlYu+ln3vPVGCdz7DHg++TnobPkXxZD2+eAY+ulNpPvsx8z58oN+8Yzw4vfmRAD6rjhi8wjFsvm0WEL6o+qU9aooAvtEBnjwKJW29EIiXvMczgL72PGG+k2+0vTEwlb5BCnS+2fqqPhonIz7uPRu+306uPpSGub3Wo4K+vPSivourmD4ijSe+8Bx0vh78Yj3Ljye/lzAoPyXgPb3wQA2+1mWuvYRuTr6LpIi+/R1bvuIo7j1Gh8G9ZjdWvXRt9jzp/l6+PHefvu8N/b1nkTi9jtu7PuTwEL6R3b+8y7BvPjCVUj7qEBa+SeAMPpraGz7GJRe+KxLDPrUjCT8Ild29/B1RPivZC71GkYg+JcJTPk8JYb70cA++LZCTvrVPHr4/Wnc+Zo8Uv8ZDsb3Ic0W+4+eSPay7IL3QHuC9dQKGvVAN1z6x2Uc+SesKvu8fAD26Uzm+yL5mPmfSmb0Qdy++YDNIvjxuBr5ldA898auFPj5I9b4sn869p57aPibKRb5OLoe+0i+GPbRVxz1fzUC+avCrPWTugj5+Tuw93FmEPvXk5DxxyxM+k95RPkN1er4Nc9W++/uOvvBO7z2uclM9adKnPR3Onr4eERW+WxXjPlITtDx/As895VH3PeOtKj4pOIK+hTbZPalUzr4Je6m+x52wvvkfc77tOMa9GbkzvWmxPb7jyfw92jFtvupm/b15KIg+WlpkPhFEtr7552Q+6p2Yvp0NTb2iPJW8ufj3vEwUOL2h5hE/iEBcvsOsrT5G0Um+xc9RvUEyID5JBCM+JmpzPPyGIj4fqRe+XJcVvTbPyT5Sssm7TNTQvcmKKT6A04s+BZEAvgmCyL0A7iG/FyI3vtqYrb7EuUE+eEBtvYHs1D0xyCY+JPEJvalF77181Bs90fWrPNq8e7x2a149L1FzvQ+l+T3ly489aU4rPQOVND4S8Q++9LV6vjtD472no+W9ZGpMvu5LL7wmDzo60KYXPpSsjTytURM+qLSxPd+55rzxARm8jPrmPVQ7OL5KwAM9AACrvJlGzb2vNTo+dSrsPZ58E74Y/e+9GRs8Pa55Pr5QuYk9PU42voS9Jb4R7Vm+Oqc9PjFvlz1uVN27XMGPvQsmHT0XGei9hS4FvmGNor7zfoQ+eVUhvnj1Rr7nIUy9/Dehvvx1DT41rIQ9OEPfPU0AAL2ivg++GJ13PUBr3rkq45U+/o4YvjoaZT1pyn2+nS+0PS4zyr0BdKm+158Bvr0EKj4WuM699jczPeXjMb3LpB89sTZYO5vioT3E5BE9HfHKPVE3K748oCC9e9s/ukjKsr0W+lu+gCXiPejbjr2JrSW+A5yMvtDJpT1Mzje+LCMlvZPo673y11W9QW66vFoahb6CWZK9uKZ0veater4HUJQ8kCAcvg7Wjr3DEdm8WiEhvpjeqD1J91W9TWPNvR+qijuGYqS96/qkvTfPnTt6a1a9IZ8UPjAAFL5oibE9T0JQviEDBr5q+Oy9KXV+PXVAQ7727wO+n38mvRZKGL4Qs2K+RaOKvJYcI71ohvu9NsyDPjndBb4yzC2+VFhevpNWgz6fqEo+3RKCvcM0Zz7THoc+xwwfvixqQb24XTw+4UCLvWO5Gz1lRJc+SuMtvpIjDr1tPcY8/boPPo5CrL2Vfyy+roN4Pk9Hxj3faww+qz1mPeuvyT2R9cQ9pqbdve3gfz7/lyc+HqFEPd6/Kj4ZFrc+FYmevPVcbj4OOeg88bN+Pv7VAr5dfRq+QVF9PUSPFL71vh6+5VQ3PvlHI70I6za+VSU7vrrnML6/FYg9SFTtvSmit719RHQ+MMNhvgvUkj7TVhQ+ndN8vkLKfL6PMgO+AIeGvJ5Oqb3XzqC82UEaPFZcWD5qHVG+CmSRvaZwO7zaDNu7MlIivdbBGr7w+CS+rb/uvuc4Nr6diEa+2Xm1vUibnz4mvmC+VjwRvhBr3r29/4++d9piPnGRXL575Qs+rmGPPWWA0T2jM5q9Vg8+vt88hD51FFW+0AY8PjBHNj5POrQ+CoD+veIAsj2CWnQ9A2MVvY+3lb4L4py9Q4y2PZqv0DztWd699rcmvWFkhT4Ue8u8elwYPmd2mD5fUxK63APnvZrIJr15pb4+a682vrpUt73hjAS+Xe3wu1moFz4It/e9TmcRPrmMKr2C8zQ9jrkYvguoXr68tRa+3NRPPgNkAL77VVq+Jhg1PWSJ370Gp2m+/FhZvsPXhT7h7iM9e24lPU27PD6paLW+FCwcPg5Lmbv22ts90EcMPm7iE75QY9c9NBiFvaW+oj21U8K9zVk/vq1CJj1zIKK9vgWZPhfD2by9byO+U9vluaturz22dR6+2C5vPmi+VT64u0w+jW0KvM+u7734q5E9gzftPd4t9725H6+9M5jgPXZtvT2B/vE9uhjivV+MwjqVdcs8QFQjvuAVVb4jTei85CmRPAr8yL1lCPO98lFrvofgnD5/WWo+Gp6MPXkPGr4xbIA+2qqbvicArr1t/Xu85B5QPQFr5L3ftTS+oANZvs5p6bzmb5s9S/RSPmvlgb6PGka87lCSPrXbPT5WTqi93sI1vpZWeD2AXDc+gpRKPpx73z3gEQE944lQvil6nz1V3qM+Pnb9PdHyHL0uY5Q8USLmPFYovz5X2lu9keYXPvjWzr0WDSy+UH7oPV5aLj7rwIM+cHXKPOupQT6tFia+a7QuvjdDF77X9TW+a0DPO7uB2r1Ojcy9ews1PtN/Or45IY49fmyPPcmU3LvcZoU+aPwCPuKONT6O7DQ+HIUwvpt5cz5FhrC+d2wAPn/+VD7Sgci8k8AsvXXk0T2FOtk9BL03Phi13b3vXi695KlrPVvOFj67Ahy8nG+VvUdDJb2f0oi9QqivPDljk74XLRs+gTv1u1MHvLxSrXS9yPOMO4VtOD0v15m7CwttPajWjb6JD8k8ME4SvoqRAD4UMHY9zeQ4vj0sy70ddQo+KgWQvXJlMr65cAu+VsmPPU3Cnb1nymU+J/I1vpYp8L38P4u9XiKiO2/2Pb4pX16+KH0DvomScr5sZFm+08FyPTGoQj3h0IQ8qAUsPhC+571utIy+MIQ1PZDOEr7LXMk98qG4PUmDV76a5eI9956uvaZ6+z3D8J89wxKgvvSTHb6vvwC+vl4DvjyF/b1Hj1e+4wr+vRXFUb5p3K48uU5hvhfdTb7uGh++nKVSvI8d4Ts1kUA+a60rvpptpbwchL+9q0sPvXBUZL5o+4a9Y08dPY4NBz3MOaQ9Ew8LPszmg728OBw+6DyyvYNhlL5+6qO+EDIavtp5Nb4uaDU9ZdLXvcbVjL05Dok9aTpRvmt8uL0P0CU+IczyvVJNEr5ZM649COoXvsVUl7xMBWa+zeJvPVffFb6lZCG+zMVrPqIpDb6I8tW9+F0lvtXoIr2Q/D89EZBdPf/fOL5m8kQ9a8COvtY2irxJIUS+mUYWvkRJTb5ozhe8cn8mPsV+Pr36xSo89h4kvvjnxD2b2PA778X7u4s4kL3kPRy+8Xlgvk4VKj7kbUa8KdktvmzzX74ErO+93fUdPEPmTb4BjnQ9Wtl1vtoubb59Q3U9qrJjvU169z3OLrM9tj0VPj3Ljj1momQ9cNjEPUEk/j5BcEA+bS5ovhp+5j3tiSQ+QReevFj6e71Z/Ki9+6k1vh3IEL61NLQ9R89zvqPO4zzxyFw+z7TMu4XmFL0ylwi+KWUSPu/rWr5sx869d/Revg3SIL4s8Om9X3ppPS5nkL3XlqK9Z7KzvS9OrLrvINs9vvQyPX5YRL3z55u91D7/PaJP3Dyzvzu+rlJlvn+Cor1no1o+MMguPaWQ1r0Wq4U9W3NhvnhcAD6AOCI+DpImPt5/HT3I2R4+Ylwbvk4UTD72QnC+gixmPFsNST30NMG9rdAvPcX2Lr15YnU+2ty+va7vbT5VYlC+o1EFvlx6Y74ATsi9hckSPpEFXL4reRy+Ei3UvDYqG75u8w++yAHlPJUl/T3DBQo9OwVyvmetKT2GZ8u9DbHFPW2EUTtSfYg9/1EiveHbCb7kePm9yriYvVlzhT5n8Zq+TAaVPftAnr3AIiI9D4KMPd7kcT4Q+Ve+4moHvi+wib62sJi+3B6mvdPlTT4hqzS+oATGva208b3vDo+9KEwkPqxklj59+5y+NQlJvmt3Y75/RHg+SLEHPWVPqT3hOKm7tI9DPQnuVz5yWga+BC/svQKfeD7b2hY9hiVDPh+TPb6siTK9GMRzPUp3Fb45/MO9YP7OvbqsLb7n7O09OSBhvkgYxr1u+WI+LE17vVZ6/TwpfpW9lCCRPIqkjD3bEoS97JgZPcluY75lJFe+RHMTviqqP70M+cE9VOjlPC6OkD5vpEK+96FgPqK4xb0ppju+Ss7EvapKsrxCyCC+fyP4vDEzLz7EOjs+HWiyvJiRAD6EEzw93kqwPj5Qu71VgBc+eq8APrwFDbyNyRE+me3fvMFouD1j+za7ZEJTvJMFKz5X3SC+Nfp+vceWVj47tDo+olmTvXtVOD6NLSk+8GikPV34LT4d8Lw8zQXePNPRQb5ygje+FZO9PD29zLwXTHI9z4M6vSOjWj6szaa9YKKkPkBPAz01TI+9a9cNPi6Xlb0RdOo9xd3VPZUNrT0Axl0++L9MPsLNPj6Sz+o91FsuvjFfLz5AxiI8V0oNvmA5I77kuga+zKa1vTIfqj2//Ok512oiPnDws75FUE88oaSVPVNaiT2UmD09+E95Po6qmT4reTi+R50GPrZNp77lgsW9+EglPUblHb6brAA+AxWXPs4QDzzj0dQ70WIyPUytZ77p6909t9CQPAnhLL68feI9fwNcPbouqD09Kq29VZzmvesFnD7Ygh4+3l0pPr8Rtr0jgSC+n/IzPhmHCD4+TK890ZiPvWKiEL2HCmI9uT75vaaQTT5jIqy8e/MCPqWf2z0w4AI+jD2Mvu/p7j0BKx0+2TGZvSFuXL7osxA826+2PDjXmby+MIa+YzoxvXOnZL6sCss9x6PLvUC1H75KUJ29BwckvMSfkb0e+7Q6xpVDvI6Oyj1CVAg+UHiaPGsSSrqfH+w97wMLvMg4cb47AJc9GxWpvQJMLb5me+i9m1wdvm4cTr2Yuwq9/D1QvYr+Ib58Sc+9rMVGPq4hXz3fjSw7WYwePZZcYb1gPyu+0mI9vhq3oD3cf3A8pYHNvKv907vDcy6+sB3DvWzfur1F1v28DX+CvKdLR71Ofpi9sG0ZvuUjzD2FyEQ9mVpNvOvRib2mwEE9nvCPPY5fmz2lL769KT45vpKAEj3auS8+sqCbPTX0ZL3LzyC9/UNxvtxD8jtMS2M9U2vFPVM1nD235gG99KpTvr7zyT3EVRY+0viEPQ1Cozz27YK9IKaAPD/0Ar1bO3u+5zyLvs/NFD4Oneg9ULG7vVtrez2hLBS+In2avY3h/T38lD29miVWPTLrAj7CMMi9XiFbOnV/Nr4owxW+uEw2vhKrRT0SABW+OXYpviRbWr4jsvQ93VwpPq4JDb1d3YK9x8qSvSxN3D0ddiO+1EoLPhKoBL7hiu89rWnQvfikFD0m+kU7LxYAvRAK57t9lC6+epOhvR/q6rysbbw9S6CUvR0imr0y7CU9YqoSvgqg2bx9mMW8jHj2vQB+E77HcYe92Is7PRPeN75Ly8C7O5nHva82MT63O6s9i4gePcXiIT4fotw+Os03Pr2kbb2li7o9Ff5Ivr8kKT5I1VC+z4uevZzeLb3as7w8ifuXPbc5/D3tsNe9wn6lPvIsDb6UBYI9bZbmvQJCe74Av5A97yNmPCTxczxB4EK+UZQbuzCGDz77woa95ksiPpc3LL4htDu9mCOAvYRByL0ru/q+1UPYvVzEUj4kfvg9b3glPTRahL1IBKS84v7zvf2uCz5iBDc+X7c1PWBK/bzaGZA71dSLvs0VAj4jvdy+1+OYPSVGj7wEvvU9Hsc5PTcwHb5GsXY9l+lpvv5uqz0CAjK+bSEIvqXXCb23Vn2+91qXPc79Fr7VWik+NhfbPtK8aL0E56a+s+CnPXd3b71vy6U+mO2MPstDsT5oZoW+UnzvvcQwPr5YeNU+rEE4PqWrk75KanE+Q52XvgqMwD5haZi+IHQGPmphnL7BTUI+MEgCPcD5Dz1MkKy9y5YKvbAgJL7q5Om86JQ3PVgWST5Qiv+9WKZ0vXpgQDy9+F09QYbRPTkI/T2YW1++Hvwrv0DkNjtKzrM+TfgqPaO5Fb5GQJq949kevllScT63W8w862uJO3+Ulz2R7gE+cWswvmTKPT4mRr4+fzT5PGS2Yr4fzqG+8IN9vQWizjxhQK0+3NwiPKseID50Rx497e9Mvc99Cr5je5q9i++hO+8dNj7qrVC+oidzvU54XDw3WoG+WS37vdmmhb3NQGE+eBVkvgyZDD10iMs9TzTFPY84YT0j4v29HL1XvfFCuL55wB6+UKtKPfk4gj7kXIs+cbV8vcGZZ73RmBu++gGrvFa+lj26EfS94pyrPQBteL37PCY+x75UvHSaBT1P/uu8Q5xmPSanmz4JQMM9eSwVvR8oqz4wKpe9UqqBvp4dFD6YeQi+THGsvmkbTb6o+lc98oK2PfRXP70wzVO+U09ZvW18/j04Zcg+JW9NvbD34D58mbe9jqTWPEI7F74MouU8IRlXPTVxDD5/Q4Q9dBwfvlLNCb6H2nQ9wujhPT1lIr3eCto9GIggvUk4wT5/7BG+CUS7Pdl1Pz0+jMi8Al7/vROBdb6Kh5k+lbeevvTr+r6m5U88PubBPU5Sg70zu8I+uRTqvek6fz26I5890tFOvmtiRz3yCkK+Y1OzPdyFHL46k5k8wpInPrIxzb2LKgY+sDltvS75Br9Yyns9seEvvmiFvr68sF8+Wy5SPsVSTj4Ol5K95/YdvlI9hb3Jv4a9pxEovbJUjb3s7JA6+NpgPdLEc70lMiG+YXeFPWJyrL0EKnI+aedRPlp+u74TKPS9BXm9vVbMlD3jmbW9X74SvmNDob4ChUI+XIVYOhA1Kr3W6Yu9SfefveGiCL6H6sY9ODhBPOna+D0DN+q+YuHKPV87Xj5E26I9Q593vLxuQrwLMxi+Ats6vk9+Dr69qhs9g9wIPO8uGz4IgbS96GfHvbeBN75Jefc9u6qBPl1TFr7THK29X6ytuzFf372P+YC+uA+RvE+AJD69o86814pCPikODL7GmVE9NiLKvSpPCz57NLe968fhvFdiCr43QBs+VXcxvU9MwD0gLwq+bDo5vlz0L755mVy9Tx0ivlaexbzNGLQ9BoDVvLDNGT5ADqW9KUU/vjYBSr73Umi9pIaYvOPJw72FvQ8+7KD2PDNCXr4BUIa9BMYEPmpJTz329Ce+wNdaO4wLzj2QQJ48H2SzPZ73u71gHDq+13GjvQh2yb1FMLy9IKXsPdtF3L2whzq84prSvQfHKL6thwm9/jftvZDf2z1bGkO917JfvUx71TzWzaY94txoPVIBp70SR8E8k8XAvWGrHz64odM9ZhzAvWxGO75IpZO7UrIQvh+Xkr02ZmK+O9f4Pc6Wnz2rh/Y8S56RPoK/jz2FPYY9aQw6vS0kfz3zNJG9OtiQPeWJpr3QDPK8Mg6aPT3QRr1bLkY+r9YEPiraLT2K47G9W1DGPaPC2L3akQg+yAiZvZ8PTD0waIS+eLqFvjebIT66cto92EkCPupdurvO+bA9DCEaPm/6BD5HEZK+fqNDvJlzYL3aKia+Ok4bvhH0N75LLqA+FgpPvo4EnbwvQYI9jK+XvnWubzwOs8+7YJSWPqPWSz7bBik+CP4DPpIyAb0rWhW+qpVOPi2fTL33lRY+ZHt5vQi3vT0dL/G8/5ElvtV1MD1xT5g9IDyJPosMOb0fSEs+7ZKePRxF1zzJIXe+Oh63vcyD+rzjP5Y9PGQ4vjMQur3e7Bc+np3hvc1nLL7tHJs8Ah0GPXNpvb62Gg2+NSF+PHABXj1Eo4m9pgQcPme9rbzyR6y9RungPVCb6j0Ad7I+vgpYvuBWor13F3U9Pye7Pc64hTzJexE9OxI9PnbRBL7OTVC+PYgrvqZ/AT7/Knq+2FnZPlksfr3LNzE9ON0Mvib9VD54Ack+mn+5vjMTGD5eXYa9wWeyPWq+672Avmg+Or7QvcnS4D4OanC+bKEkPPD4272RFnw9GYirPbRHQL5Sfo68KKEqPlfmTT7EkjG8aRXTPHcKhz6VmGW9hwsevjZixzzjzci9zU0bvpJFVj1KiAg9jJtOvvEkXj4V/si9ZHT8vTyxh70T80q+07u7vkVeGb49kBk+CssAvtRWGL7FAJE94iRRvjDJvD7t+g6+nbVKPmvdEj6IJX2+2ljkPQrPor0bvMG+LRXWPqy7/z2ml4u+Y4EmvVZ2rj50cgw+Jgp8PqG+zr71Bkq9h6kPPX5AAL5Impw+7bJCPPkPXr5Ars+9hpbUvUTMFLzG/As+NArLvQMsOL0T3RY+jk7AvjqUlz5PYIQ9dhqHPXPJkb7faDO+bR/VPHizjL7ImZ0+HhwhPspBC76hEUG8FSnEPa+L7D2gAgg+kQhOvpFRcT7wDJe99E7rvHQrHL6X8h69Ns+KPQAKQ75D+OG9uh4Bv55n/73rOYo+QkgEPkeJkL0SZz++GCEQPuqCfr7j+du9nVqEvrbhkb7M4BE+Ko+yvvmNCT5PtJo+KS84PelYrj5aFUo97oRLPpx9Ibw4DRM+gbyjvYSHp77aJ129PoWtvjwFFL5t2oa+z/IQvqRwTT4A/rg1kXajvrhDfz6gCX0+VtRbvZdVOD3J6OC9ZPRlvtGYaD7Ig4c909mHvb6wSL7cGE69FZUAvoTcDb62vo8+wzKJvIyH4jxNnwu+DByjvZ7Pcz4wLCg8NGuevmpmBz76fYw+K7i2PcWPgr0z0Ua+aZeVPSmmDb6PIxW+NVvQPe81Br5IZgy+XvIrvr5hhbxriPG9IGM3von1cL2mTVy+DsqZvOZXlT5Pdga8OyFEvg17JD7i5iC++FoWPpJAxr3S0T8+eAAAPWdvcb4S8gQ+CwWHvYW1hT3xuHk+fw6/vBlcHj6p8gu8eArhvWWT8j2GWDi+BB+yPZNioL0ltPk9Y8omvW7iCb7CKTm+iWKoPU27yL0GZmO9BiGwvRIUJL6sO+Y8hIyoPUnHp71ezy8+stLMvbC0lbwHpFC97j7/PIqWybwwDqk9rrnpvPlQjLtyIhu+GJjAvYn7hL6YBfE9byU/vj0oDT4D7bI8AgO2PYbYpb2Vppm+F1dPPWLdDb7FORc+bUcJPiMun7yF+D+9Nk1APpaNTzxyyiQ9OJJ4Pu0yPb7+aws+YTaGvi9ic70gaiy+cstyvm3U9L3kLsi9PFXYvG6Thr3Lyjg8TMpqvj9bgD2wOt88LAzUPQraVz4a2II9UGSQPQ3/pr05RA6+u54evsBys7yAtBU+piN2vr/H8L1XOGG9BlQ6vuQr+T0rD0y9e0cxvbEQMb2Ytpg9MxaUvRHgOb6gAN28FK4ovsA9Aj4seNC96OOuvWLNPT0bl/k9a00zvmqkWDyfaAA8R8MPvRnyXr1+Ixa+wzi9PWHYgr28mXI93fOhvNu9ojyKOe89t1HEvXu6JbwsAto9uY4pvkdvj73KqrY9prR/Pf/MAj65q+O90gEHPkJmQ7zhRry9bWEMPu5bf72cqyW+Zm0yvSy7oD1xQC++jv81vXa+ab6b8He+YsvUPRYU4L1Vxze+iob0vdQCbT0uVte9q+KgvLcyML0QYgC8mso3vUSYMr0rV4e+9XeiPSF6AT4YAsm93DcEv240t71+87E+t3OSPMDJCj7p/Ay+IpSrPPjLj70uHhU9M09vPlyIRb4rzAI+yLDovUYk4TozWL49DMSlPQbHmDvIAdM9dD+UPVImST6vmK09dz9CvjRXvb1DjOI+S1NoPebHEbvgy+W97lpavsALST6bTW0+H1cSvjcwoT6NJnu9YcU+vYQ4ub3NUBa8pF+qvGOm1r3SjEO+WrvJPHXIC7wlMwg+rMxfPe0fgr0o3DY+WUAuvvLXzb358IO96UpePdfakj7iiZ49RNY2vgJeD77O2fW8l6oOPioBDz4qcaC9aRSwPTdNWr2i3hy+aEyEvlBOeL3mXYq+H1XCPR9U77z8oA08hybCPSbw4D7WuYa96fpKvvnr1r3IDB+9kQgzPojrAD7ViIY+Vwltvl8CGT+AARu+kqLsPluF5z2ZspU+5R1YPM2myj4dPLE9cHzFPVqXQj6W6Ew+gH9kPnBboD4oaSU9XZt1Pcexdz76ZUU+Ehexvkc3B77tQsQ9kHDsvYNJtT1Y7sm+M1tEvgDC473z9VO9tvTZvihwZDpOH7w9xuCMPnutNj5BAKW+BVJ3vl4Hkr14oFW+ncUJvV7+t71SDui9OZESvjR4Jr5oP+u99VwlvCPoRj528Se+nEpzvpWuKL0kgrc9vY13PC6FAL6k1yk+2m08vSl6G74TgA4/DhuevUQ+UjxvD+k9jpy3vgb8vL0BAnS+5L0xPdZCID6Bdey9yiKhvc9hrT3q3pI9wb5oPJlOpr1/SJg9etjdPH2qvb3LERw+LPWZvbk/Ir38lO09lP9oPq0u4j6imUc8Sw+9vSKbhD7mfue9DGPNPmoZer0baPi9gWoJPc0e9r5ObJE8aJSWvl/kh70mA9O9dgydPTJS0D68q4g8p7kJOSZjy73vR3I9gy7vveHTe75akci+6mpjvhiFXz0KZP49dNmnPb8UM7xGBay9JmICP45stT0YSi4+CPWJvuo9wL3be7I9v+iLvjoZLr4wW1K+9HSyvJ8DiD4ulbk9zpxGvsDEmj7AfXY+xajTPXl9mb60kBS+aOSNPffLEjz1D64+Ghh0vnCbLL7lY7k+WRYrvZVSBL68gp698IdxPUexyj70wMM9WDVbvvs/Cb0m3Kg81UMmvgF3h73CJ0I9m0b/Pgf/VD60PES+FrZvPHwbhD0BVXo+V3GxPbqq3j1hAzQ9rZuDPht1sz7EvAY+EZhCPjO/ar5ONea9L7voPTWcMr4tu4e8cBqtPRBkdr573BC+/axcPohGzDwZcWE+CtxHPimGCLzUFEW9qGihveYqHb5tgos+hH8ivYVRALulAYY8Wf05PnDfST3NTOG9iQq3vdJ4gz34ofw8xxMNvkyaAz7PECK+9c9JvVtzMb43Dxq+Y7ICPrvThb4gOLa9pSacvpa5Cb4znHe7tLddPXmJLL7R+Ey9OvEXvWwr1r32zny8C5XCvOfLeT1A7AS9wO3NvXV0ZT3eNzu9oY4DvsTXrz3JjQu9CphbPMs8WT0GmTq+n7IEvM9M3DtNILQ6WzKXvkBd+7206N48GiHIPWfgH75WUDs8euQdvo0LLTx9DDU8yM1pvm76v73lXuC8isKovkhquzz2u8K806YzPJA4lL6Xv1w+2wifvhqOf73G2zy9gEVTvZrQpzxatPA75r0NvpFRjTxoHZq97Q/xvcrA8L30gtq98w3gvBHbvb1ShKG9ww8BvrFDl73xYG6+VsXoPUJ/ez0nG4G9CIvmOwMU7z2x5FC+ns0HPQwmyjqzkwi+gQZWvtEoxr04y1U9C/kXvScmhb5k+zq+KW6Nu7z64D2mX5+9EZoXPvZ/Qz4PoIi9iRxKvRhCV76Yyxk+/GORvQU7Hb7XxlM8O02KPQZ/Nb7Rg509RKT7vVcrLr6PabW87S57PdaSLr6sdOC9RNG1vbWgor30t5a9cFDFvUz+UL5Ty5K+qv9Pvj8qoL4tUhO+xT6JvgEmDz5p/Ww9GZ6EPIxCF75BZIU+vtAavmmfYb750/E8Eov2PX099zxtZpk6JA+SPcEGFT6CvyC9SDLtvoMBA76sM1A95LMMvoQX0L2ZH4U+1W9BvpmBu73D8IC+lTOvPTOxJ72GoEE+YKRrvSeWTL7AXYe+BmKIPWzSir6UTLK92dynvTKHUj6i3nS+oakGvrvswT13bzU+woyePemojb4UV0o+9MGkviUCvr1Uh609U46Bvk3UKj5Qetw9JSIcvpqg3Dxc2qC8e8QWvoN2lb2a1cw7nDsjvVmw+T1WgYW+40rcPTD4qj14yQO+S8HJPZ25kj0WchI9kdAVPnhGjD1tToE+FI0xPfpcjL3yTgM+WVutPnwOd77KHfw+tCLHu8LqOb6IU5a9HAG+PYOTzbvLTLG9adNOO7p/M75Wskq8pPMevbQK7Tzz6Iu+AvLnPbnWg755wiy8fR43Pij7sL7A1YQ8Sg4Ovqm24T22ryk+n8LFPuP/y734pj8+ZWszPkX7pT7c2gI+5J7pPrleBr2p2iA+/fZUPBgrIz5av+e7RL4svgKQEz6kIx09aNmavMsbVb7udZY9ltBYvgeVpj7hq6e8wyYUPrTfXb5KvQm8k8szvgVZCz7r+ci9xVmePrIyj751U5a8dWhAvchCiz59YVG+MYjJPvV76j1L+ga+++mrPbX3zD3G5k6+4QGZPhQ3gD7sOCg+bfWzvT/xCz6psYM+w2QIPIR7hL3yN2W8iq+SvfPXoj5bA0c+HxcRvAQGrj7NA8c57/dlPeQDlD72fAi92pb7PfHbWr63HdQ9sF7oPT+hOL3h9U0+o5tFPniZJz6XhCa+je1aPZKqvj2KflE9HUpxvdWhpbxQ+Rq+0zgyPLr6oLzWlb69bKxLPtK17jsacl09yrkYvmAAt707ZSe9rFswvvU+yL1HDAK9BXQjvVcicDzVdKo+EwgFvr+Dbr7amR0+Ia2EPpGYYD7W/hw+iSEevVVSJD4pOtW95eObPlM/rj02TsA9S2KVvjR7Xz6lJHC9WSM9OwmvxL7yy0K9ZnOcPq527L3/dGy9NfKxPnjhvT1V7Gy8dslCvu6t9TyrTgk9EjVpPsm9XjyZG+s9tdpqvVH6lj5es0C++NSJPWAqBrylQQQ9oikpPmYDQ74u8I69+g7SviBC77ydOBG95SdZPlHjhz6KwA49IuKqPXJrCj7+Foa+SrqNPfl+I765pim+UGTSvjVhlL1TO1c+m7aFPUHTsr5x/pw9UROpPFGThL5sOBW+KgVsvZQ+ET50OzW+FVmRPvCYPT5e4hq9AgSrPSXRVz7o+J2+3NGbvLcYlr7FYys+6KMNPrgqCz66K6g9VGl8vckYgD6UUZQ+UxWavRo7ij00H/C9ANJyvuVrfr7ypxQ9/ZmnvRh5WL5WnDI9ivaavTwtgb15qC8+SSklvuANf7zD1hK+DMGPPc5Ea76970+9znYWPr+dkz0wuru9pF8pPeSdqzxQzYA8/kNCvjlTLb5xmdm8jvREvcS7BL5pUoW+182iO3Y7ZL5hndA91m2VvcROgr7RFeg8Z8DbPQy98LzRnrW9cByXPfB+sr1h7508vEwwvjmVwLzh8Nw8oWPTuxBbF75+QHO+DHDuvXu11r3rvLA8+fnOvRJTNb4TQMW8f1LkPeXiEb7XfpS8yOQQPokdjzsAs868NI8jvgJo/b0PbuA845t/vhMstT1JuQ8+0Y8Uvqe+6b0bnDe+bc0ivt7juj2gPSS9pK2gvTCYMT4r2ki+aog1PC+pFT0XnaQ8WzUrvrZjkz1QHx6+LmchvmOFFT3y9kg9X8zAvD6kor5nlD69UXO9vZ6Ib7sZdL690/8xvllEur2Doti9rMLkPQ0+Fz1g0DG9c6SfvRVYtjzliZc9EbkZvs+wrj19zE6+KhJOvcEsRT5vhSs9qWOkvRIhpj3w/BI+lgdivabHkr3vFAQ+oAl2PEgM0b2pIBA+XjW8PFK/CD5/Zx88WCcovtrzO74/LXO9m+BrvRVSmr3Ubz49BOLYvaeiPr5lNCy+cvx4vbI8SrxRkq+9gfRkvtUigD3WhAq8ubXWvSzJCjvgp7E9b/XyPJkttz3SrUC+5J74PVMYIj0HaU6+E0Z5PdeLCL4VG1G+ptxUvU085b12wUq+H/Mrvuxzir3gAqg9hGpBvnK3jL1jaxM+i08svUXakL7se0I9ToADPqb/zTwxOvm7810kvk/NCj7XfX29Kz+dPVhtZ7wyYxo8/Rs0Psl0Wr6qvwk9yuqPvkJV6r13FBW81sBevT/7wj0yH4Q+5h2rPTffGL4cH509BeOLPfjZtj1wtS8+e9lBvqsnQb2ju0C+vi/7vMVilD1H7dC9pRYRvqRZPb7V0GY9A3NWPo7mmj3GyZ4+9Uw5vknser3/zlq9nYZZPTs1XL4NjqE+OJtiPXSPVb673Ey+8Tzcvc2OLz4EAFG+kPxGPvDGEb2oyrm9NQZoPRgflz2/ZRG+VSiOPntPX7xLHYM+Fo1avLwwtb0rOYU9YezkvcC+kT7i/IK+n7wMPomiQb6pq3K727RSPnejXb3d4vK9pMBGPgqlAD5BMUY+pUbIPefy4z5Bbvc999ySvW2Oar5Froo9/5fXvYMtuL1s3Ce+u5Jyvjm8nz2lnF4+LM0oPsZjCj3DDG++rdaMPeZW1D25rEa+8zU+PmsMnr4Pi+q93hrVva/uzj0fq+W9lV9ZPdXOAb7p2aO+VZofvvDCNj79ace+hloMPh6jgz6SVig+do7IvRJAgr2gCwg+o9oaPtN3lj53UNk8c6R7vL3IK77Db+E9n1oLPhgZCj3cE+u+FeY1vmEpXT36owY81nkcvj7Fp70T/Ny8HDteukpErTxMDi2+kW5ovrFnnr1hN62+bZbqO13spb0+v18+nO8gvgx6ZT5WctY8wiFEvaVWmb3Jf5+9aMoVPi6aPz4WygW+p/BjPhNVRT4nPOW8w+Jyvup1fr0rW42+h960Pqaa+D1dRc++WD0qvKq9Fj0ujG++Ki2bvCa7bL68Ooe9rZoGPrfHgL5XKjw982mWvR/IOD6oRqM+xrbKvgh0lz2jHjc9KlrWPKh6LL7i/Lq8j/A3u6cbWL62bZk9hG9svRBwhzwFcKo9Sf5ovVUSUD5XwTs8WhMMvp8c2LsaiOK9ucu1PRPdpL7CyrQ9CIWWvRKkkr1Vlks8475IvmYYLb7/Hhk+MJ/Svr1hXz24ZRU+WA6QvkEDwL1W/Za8U1U4vWG/8r1o8gu9wDZMPsrhnr0LhY2+T5eFvUmIJL2fmlg9kl33vW9bcb4fuhk9Am0QPjUHSr5cYoG9Mothvhgvqj2cO5o92gERPhjj/DsUdNA94r+OPWOjJ74ljsk9iZCIvU0yIb5sdP09oOQHPgVikj0kNCg+B+4VPl0qY76oaBg9SBpTPINyjD1u0ZQ+O8c+vmIaGT0RgK89xwSDPein470oZd692TUmPF+sCj6367c8528Rvowq9DwxbQq+AWBevc+8a7wkNzS+rNaYvam2KLyu6lW+KwGbPej/jL3I5e49P5wRvX+JsT0OGwi+OuWDvgb1ML6Pk8E7x5wAPY89B770Nta7m5WRvuxPrr4fZw6+3puMOxZ7kL4c5kG9kll/vdtUlj17Ar683IHTvAHeIT6P1KQ7w9e8PDukvL0icYo93WSivOGHfL252SK9frHHPIis/r1Wc769JPa7vLdKjb25raG9qBIUPpNYXL5ZkDS9NmeevjJOCr98DTU8E+wwv3Y1QL6EEso9ESzLPb/TZT0cKq89nVuUvdMd9r0jqbu94xt0PpIqxD0K1gi+Be+AvXcekr7RJ3O9xXuLvjegyr3yUpQ9GFhdvUzH/ztwZ527z372va6JEDs+vLA6qO4tvvrMV72VgoC+WkmpPZxSFbw60qo9QKHAPfMjQb4La5C9moOIPP+WPT2+/yY+dZyKvkL+E71f5Iu9tASCvsrQub1baWs9EV+BvhaphL1fs+u90rRrvUKHEb68Upy9Vd1zvSLUVb1ughO+aG9FPs+zM70tYCa+6toOvnSq3L6KiSG+iTbWPZFgjbz57XS+Eh/1vIHsC789ViW8YZ3lvSMbXL214HO+lG9nvpq1u736IUC+xgMAvhwgrD2vs8M9NW/IOnG7gT1m7TM+UQiRPDjdtT6STZs+fIlCvLTVn7whZSu+F+8lvq1yxj0Qs6K6mcU2vvCaRjwZTqc9MMcDvnobnj1UMbE+dXDFPS0FmTxcMjc+1ciqPlenlT3xcpA8ryCuvrlBor0UVIW+Apa4PS9uvL0kE9E9BfMHvhT8ozpo5HM+ZZrTPKcGgzvBXhc9KwzUusS08DzZYKm+1R6kPZgKNr5pdBw+9gRTPowHsTwfwoa7X1SEvbixID0/MhC+/Cc+Pr8+JT48oF2+Ztr+Pa5vYzwMJ0a+QxVAPjT7QjyjIag+Z5yRvijcH70ZjRU+QtecvU8Wmb1zkKq+6Rk3PRPynL4qCzY+ZRuZvXNZMj3nNeq9Wc6fO5hnCr2G+oy+7l9WPceG4r2Uo3Y8k5mFPqJAG76vJqA8+HK/vTlm7zzdWvK8zoaBvmUYgD0lWqY+ZuxfvV0XDr35PqA9t5mnPtVl7DxW/os8dHIlPsem273k1YC+3LhxO1969j0nDxe9f5ADPOdYAj5isVm+828ivkzVVr7dm1y+yU40viaQZz5uVTG9JiIRvg0IAL3O9RW+7uwuPLUZR70AR5g8xguevi0ZI707Yru9RI7VvdnAbD5kn+K9I7ufPuLYYD61vq89jnKIubea/r3l1Va++N2ePl7fQr2cy0A+Dm8avhAR3r15D646fkBcvZgwlz3Onzc9/TgDvmfkXb3cLoE+uX7zveqivD19rjm9QTH1O4tYvbsZmEg95kKFvb+sxD2L68+9nsf1PVsQMD6D2j09z3lUvjuGg73aYhi9GMm3PDrtQr0sE4g9jEDCvYnwhD5nhIq93BfjPAv1Lz68lwI+m2n3vUkiIz51lXc9Euwpvn4x37xMX4m9V9QwPhhrCr75YqM9eVdPvdixdz6KxfW9/t4Wvuedmz1SD3e+05kJvtpywL3daLE9jGkBPhkl1DwbxiE++sNDvNVApD3CobE9OHEdPbhMgj6lOSQ9ZOuKPjdeN74Fkic+wAb3Pr7YO74mows+YLeVPpCSiD5FeaC8Mz7RPYyDab2DrMU+WVOoOnQCPz5w7Ae+aNaaPjLDK72GHvW7mqydPYhDqr2Vu749Vhccvnyi371ZqQi+ZIlaPsuqlb3pLd+9H1tKPbQyqT7dG729oyDLvYdirr6qIp2+BqGuvYh3r70xrVG+IivNPtvg1j3Ia1e9IzMXvb9ufL7nSTg+ULADPY37OL4m91A9FdiBPVC9eD7ySj089T0Ivo8bJr7p2rK+pqXevETlOb0KVwU9xjZKPWgscD1QWtc9HHtWPp6AKbyeO/E9aiyNvKHJSj3dBzu+0c+WvVSsqT0VVh29gm0HPb47nz3tuXC+OYBwPrff271xvqu96PSuvfXQjj27D1g9j+NcvlqgAb3yNy++sXHDvSGaB76xL4K+/NMQvuv9Mz2KPS2+7zOiPUSDDL4KAeK93ugavqrGXb52DT695UDEvdujDb7CIwo9gBC1PckNiL5UopC9AxjyvZdo1L2nWqe9j2MqvJ/umL5l2W+8AH8VvkKiMr6UBmm+DeUjPA6S/7yvTOm8a2N5vo0Vw7z3m/69UFNJvmEmQL6S+km+c0WyPC0HUL4tKIK9EYxyvVDlPLtyWcI8hJFMvZxA3r3bjY89WBB+vqnK1L11e3C9vSURvhRzhL30DV682StYvaNKuDsNav09WNBSvpDO1r1Dv9c9aUngvQiGCr1t0X+8D8a2vfWmDb6WWhY940gfvmJlqL33uSW+J2eMvflxDr4017G93RQQvokh1D0/fZe8asvJPQGnyL1ncVE95nF4PbiFWz3cH7s9Yls2vmImbL6ffk2+UYYBPjt2OT3N7pI9k7eWPe7HA76dv1c9nG9hviClDD7G/uu8WneEvhpxIz258Kw8Bym3vHBFZbx24ji+lI2MveC3tb2bDSG+Wr4Bvt1ACj7gxie+ghnwvLO1t73Y1KK9XOqaviNI+r0xBIC+zq5tvuOfgb33/1S+weYGvolsYT18HPC9RMIovduJQj1tICm+HB1Mvvs5Aj3yWRa+cdCkPVNsHL3JDe89E1BNvswU2D4pxR0+ETv8vX68S77iVl++PnMJPuuHfL1Mmy++rmUOvs2ueT1oRVk9wvG9vnNYu72O8Vo+kQUFPgP1Vj4zloq+KhD1PHZ6ID4fqzU9o5X7vdt+Hb6kH+g8aadAvIlq8jzqF+w9imRxvSictj0a5b+8cm3EPfSEDj0yfYy9XFAfPmUzRj76uZm92mlkPsvPwTx1F8E94iLQvN+eCD7ec+M9VkVvPCAN1z2xCV68srZEvFMeHb5VZyO+ytsQvmx/Tr67vIC+LZ05veMM9r0/7Qu+f00KPn77QT0rSeY9FV4IvvEfSL6SN7G9xOQrvpZcG74zMPQ9IW0JPphylTyvq8I8WUPVPZHa2DzNrYG+Le9+vFtBDz1EPwS+QZmVPr1/bD11MaY9eLaHvrYzlTzhqsE8ANEovHKaTD6G2jo+tD2JvifmsD1J8li8WC1mPr9tIT2c0xq+RG2BPgI8i77Nk+I9paThPM9pEj4R1yI+cSrBO7WO6D1oa2e+O617PmCUGr60+Ye+T4moPsXTdz4ZlBo+SMpGvjQLPj4SNdM9P84fPh1UUD4nonA+ha4YvkPZ0jz6zVa+yuR4PlIy7byC18a8xJbXPV2eAb7mngE+xNwFPbiGvb3Lx/u6dS2ivcHQbz1lhZw+2idyvILHt75uleM9SQOzvMpA2j7RV9C9+2EVPny3TL1oCDY9pKGWvlKtgz3Nd4a+ze5FvnrjML4Tu4Q+1DHbvcc3LD7PX2M7ruI/PWcEvj04Hx++KCEKPH27/L3iCVq+KHeHPQ+GI7ta5xc8vCKRvWakqz6yMSM+7y8cPcp6XruNmau9ozmWOlsdhj6EKVk+wJ3wvdlAiL1LVFK96fXpPSyVSL11wSM9mDU+PmPqbz7ge2a9FhUuPtubfz747C69W2qLvgC4Fj7ZaFE+uQQEvptEfL6B50o8xFiwve/aBD5y1yg+fCFcvnNFvj2CWWy9WzMtPqFlr71TUyQ+w5oSPtdTSL7MnFG+sb5kvSrsIr5uA2w+zOOivVYAGD7dxj8+IruwPSO8Ij6osW47o9EGvfq5Mr4NuzM+TdZyvgDia75uGFg8wFQ+PpVrID7sqqk9Fx+pPYa+ET7wLXk+vCIXPmimRz5YNUC+vEELPKs1ND1X7D6+/rjUPBhK/b1i2T69EJrLPZLzqT2kSrY9PPQ6Pr4lPT0dkD4+iXCKO7r27r3PAKI9amvtu8kz9D3FMsK9pr8qPZpsrj43s7e8ZGIuvJMwNj4kkse8y+QQvuhzqL1cY1I99zeQPUiY371/X7u63VcJPnLpRr7lBiO+qZr2PAuz2b13N1O9ipw0PvluRr4VckI+7kxmvp3m9L0WDIQ8CYwIPa52br0A/Gi9HYHMvTuedD20jHm+IvBFvVPLIb0uJQc+I8qHvQV/HL5w14S+3nNgvtoF8z0WRIY8PGtRvQCHir7Zw1u+07YrPULWQT1oHAO+02UqPVwpfr7oZBQ9geIcPtQN+r2w9oA9j7oRu5+qcTzeNbK6PVCHvVegkb6TT+u9YkdBvUZQnb3tWhi+8xtHugocpb6XP0G9Rv+4vRGLNT67AZW9Q4cfPv04Lb7Lyjm95+xPvtQm8L2Hpz69XcjlPVTQ8zyM1hs+DDaPPViler5AhYE97/r4u5ESeb6Ci+i9PzL7vIVbhT1fHgc+SXtwPMQpIT7A2CY9/tMZvsfrybvdeKE9bNFevQIJSb69ljo+dCMGvm+hAL6KRx++QupAPtnYiD3956S9qHtBvX1cxr2E3k2+2SJDPO8RJb6/t0++/VwYvTQPDr6wwzK+NJT/vYHdxbyW71S9it4tPr2GWL1+dAA+/inHPYCw2r3f4eU95JIJPvpow73fn409sqFlvdKIsrxSnTi+dIjkO6cU571epB4+0NW6vRkyNr5te5q+OvIfvuSwY71WXI69+VoiPiPIZr6Y+Ey+5+0+PR0jfL7IX2C+QDQAvifwgr05Uco9GcHFPXUu0bv4mo+9wpo2vcQ78z3vwW8+LUILvfFtgb2hVW49uOnXuzAaH75M/fG8JlB6PBkSk73ZelQ9XqzKvoPKGj3I7qM+861uO4m1NT17wug+AIADPEnXJD1C+yS96It9PYsLCT6ady48Dp7vvWPV/zyuZai9WlVhPjy9J77Ekg4+CJm6vpD/C73f8rS8AZyiPaZMDT3D7xk+4ZZPPeWK2D3TtPu7l7F2Pq/mI76O5cW8Wd+BviX8zb09o8a9nHgVPVM3Qz7XpiU9CpxFPRWRor6PL4m8AotAvcTyWr57EvW9NoZuPVUjpzqBcq89P0oHvtUGMj4rWnq9BqSIPjRM5713fy8+FJCavh1ylb5DfoU+JaBdPkr5cL4lLrs+FElsvDhElr3T7JO+lDsWPjV/wD08SFY+ILBwPlDatTzBwpG+8YMRvrvTHL1S9a4+WxURveewRj5nstw9a8UOvvRWw7wxclE+3PM4vgq9dz6BbWk+xAznPiCbs72AuL69LrN9PUrikD6SdRQ9RvQ7Pn6Pvz4re0i+g86CvnkB+jtbmqW+WMg4vgF36L0c9xU8kXLAO/1tNr1jSFS95AAyPpy0hz3n2ZC+1CS+vno4WL4+w8y9rzLfPDxAcL3da5g7SBEivR0L7D1Vypa+HMGBvcGYfD4cVZA+wdStPvxL9b0x760+GEtZPEjNKb0p/gi+aBuAPc98L775fQQ9HgsJPo7X8T48QMI9ll2BPsBmgb4sG6c996aZvj480zwel24+Lz48vZL/+r3JR708G+DeO5BSjT77E1W93/gjPnMPwz0QyQE+QZvAvOPSIztcYkM+A0TIPQ+wtz3bQE6+yI8hPa/vDr6fRuw+WCD9PUmi7zsfpD4+c0KOPep/Ej5UzTW+fjp7vfkwDT1Gwsy9jRL2PbTkPb1CGls+L1XFvU/YcL5sCCo+zpgNvjrc6T2EDm48nsr5vdRqMj5/ufi9ZprUPASUl7wFnmC+FjeWvtxSEr057kE+DeNFvSYgC740eWI+WrdwPredUz7CCby+6K5+Ppp9OD68s5q8m4A4voPNMb7INjI+VcuCvhAdVb7VYpO9l3ifva6Ahr1+4Ru+GRcSPhW7qj6MHB8+/4+BPW0byD70CqW8Mpq0vel8J75j7Ao9O+lqvWtYjr4/8Tu+OurdvKe1CLp1jBa9fuAXvufDtD4Roo29Ptp8vaBFhT63CZQ8iPiQvZmvLr3HMuC8l1CsPdJoCj6sxve8Kih1Pg03Pb69N3G9aOMMPgF7vL5301y+XvSEPqzyaD05AIG+3HogPjAgaLzXykq9CMxqPRXCgTxjK4I9y5X+vRuuO76EF90+XZKNPo5SgjzhL48+It5fvVWPNz3/J2k93xLJvL8jAz7bHNg9zUnEvtgghL44Yfo81VOdPcDeTz1lCYi+9Oanu8ddmD3y9ZY9yyIqPls+8T2W8Eu+lAzJPWKBF7uIQde9mpc2vYAGJDw4Lk09APk8vtL7lL3cj/q8T36rPS2L8j2zHBs+TaaPPE69bL5pVIO+N1AZvieEbrwtVGi9yI0nPXoB8r24P5O94C/bveYfNT4gKQg+ioLdPf15KD4HDh29KTaAvvVPT773vx8+FU0ePikxLT5Scw6+/AmgPN5UOz4b6lE+k8NyPhjKlj2R4gc+OWMnvc9LEL2jVec9gk86vhU3Br54edg83lQ6PM9ZC70iyEq+ToJivA08Uz4//xo9cKKGvbipIT7JrSI650G+vVuZJr5enc47iomrvcGisT3CtZQ91BF4PQZ5tj25niE+H8nGPVa1KDx3xtu9NpMxPbu6bL1J4hE9WB6EPQHQ2L1z5l2+1fdvvbx9iTxKbRw+sQQnPurHsT1MSYE+ec/CveoN6T3eae+8FdwFPgkw2z2453S7voNxu6dNtjtqfAU+RhDmPdr5yzxcD9y9BMkDPrmt9z1+CrA7B8lSPlUGRD7zm2I9qhAePiN3sr19baS94aXzPTLanrxhRQQ+XyzNPZDPpL0S1z69RFxGPU4GLbyMgeG8Vp92u5pz9j3LVHS9Mt8UPg3IIb5DWNs9rlghvsIKrD08tR0+OXazvdWR4b0AmBc+cRD7PbUQZr67jR4+3cfjPTyk5DygfFG+dyIqPmKGfL1wcx89ijbkvFn3Cj55TzK9ost6PvLlNz3oC3o97tl1PebYzz30z5I+BXk2vWK4RTtXC8y8sgNoPhSAQ77GnhO9oPWQvp9xB775Yy0+0mIAvoaPjrrjrCO9ev/bPQ4Umr2z7tE9Jm2jPZpbqT2MiUq+bhLGvYHdjbwEU3S9XFyMvrg5nT1wXRQ9najuvZ+AS70KTsG9iHTBvOWjZz7LkiC9/yOGvQVjaz5JMQk+7DPePhRHDj5FB58+CKJAPqmySj4CIpw+/QJsvYrgdr3nt7M8kYvJveMakr1SXxU90ub7PRxBf70ym0e+bcCKvhsrT75FmMk8yATRPjqJ+72BimG++qnFO93FcjwdAay+cZbRvcluk7wGprS9jG0OvnHknb1MRhg+/0AqPQFxDD5P7Va96VPdvCHxjr6LQzq+5VwzPmdVOL5N0A0+XZvEPYYZcj6Icr09lh6IvRMmID0kYFS85rhOvjMaUz4CqJs9ELWsvrjqZb1pym49gUChvQLQ7D2wtwG9FhGkPDdDTL77/LW+Be9gvmLm/T3wJKG+1AfMPsxpCD5Dmdi9U/1hvqgE0j5K8929Vbx/Ptu/JL3kdSe+InsQPowrlL1svxG+kKZEPUW18z0uvny+Qao5vUhxQj0VFpw8QARVPAdUxr6ZqEI+BShYPpVYM7xwQLQ9jlhOvgQumL5Pf/E9clnYvSTgGr4UXYC9iTFkvUeaJT6aZ/+9kH3KPW09dj6PI8k9h0xAvk1v6r5DK4W+bZD8vYOnZr2co1s+sY0gvqHPTL636PO8Ia6PPaFDjrwbNaw+PuP+vbSEwr0PFWe+dONPvvqtXL5VBMi94LNHPumLnTyIVUS+lS9FvnOW1r0ku6A91C18PFtBMj6Ecqq+tpp8PiBGAD6ta9K7PQPCvUH2Mj2lFyQ+b2JFvol/CL3OKqg+KKXqPa48oz4np4U+85llPvNYkT2J7aY+UPcivXO+xjyLwS656FECPqDpOj6EAcK+RaYDvgVjfzzJRpA+k66OvoIKrD4lAkI+IRIrPvahWr4hyoo8E9QoPo4eAz0kuG08Aq4mvU6EwL4vJHG80LgrPlB3nTuctxm+4L+hPfK6Zj7SAWm99bH/PRTybb40Sta9BMmsPVYRDD7SLZK9BQDYPe6NQL1E7CW+LUZ7PttU8L0LleU8Zpbwvfkzzrw319E9CviwPl2MkzybIN49FmYbvfRNJb43qtY8m7l4PfXTlb0AOw4+X6h4vR5vxL2pKo++TsvAPqRVib7liTo+84PDPOfFM74BU4s90JFnvicOTTzSDIY+wullPej+hz5oxd676StPPloPkL3Ata29N/pavtc6ur0m8Nm9IsI2va1Pjr7datS92WZyvi/0VT2atcu9qiKPvZvd370sJJy99JHNvUxYiD1jG9Q9hGvovfDsbD08uoS8Jx+aPUlRfr6IPKI9hyXmPRPYGL1HrPy97htnvtEH4L1KgGs8SY8qPndU9jyo5289RzMPPpTP373dunQ+EzfovRDHoj1/+6a9/QLYPCzrKzwG/fo75ZdSvcv3jL0MiHO+8W6qPEN1GD3KKVu+hUOpPXwkFr5Fl0Y9te87vh4Pvj3ngQc9qIwKvhS9Y71Kd6g93xwyvFEYt70X3RG9d8upvf3JM774Hw2+WJupPLe1kL5CwPC9xyIgvka06b1ic0U9LXfvPcUrk70HFyq9/T4lPPGPMr5t0PM9j4MsPdT6871sb42+XXkLPYvu1jyCV7O97G9ovozth7xKJmo9ObjYvYYUGL6XhNO972GFve7WhbwF+iE8jQ0GvnZHSj2P4BO+3v0xvifZFD6BGVe+7B/bPRI2wj2Raba9IWwQPrb1pz0HZkw9qAVyPjZ/eL6/8oM9y40xPrLxNL4m4Mw9R8FGPC/VWL5KJmu9J8BsvjxFlb7HK469qkqbvdbDhD3VtuM98+PFPVuVpTuuvws+qawzvni7rrzAsEc+dtNivoD5Eb73BuI9kkMWvf12nr6ue/28kYJxPf/P2z0sPYM8TscOPlFMvz6tfjA+9roTPgivcL6GH+i+RFKEPvIqQr5daCO+bFh6vZcyRD0jvCS9AWYNva3qZr4+8YE+e17wveO0/z20DWM9eceQPfbEuD2b8LQ9RMTBvg0b/L3u9Bq+xtarvU+YND2bQDy85K0YvowC2b1VZtC+eujkPSfzxTtusxu9CigBvpV8ET41fA49Kim/vGXMjr1AW1u9gW0ZPoTFVD4E9/C9fI6QPAAser0xMZ8+nGSaO00DUr0au1k+wo8evb3qKL7nKxm+WcKpPpaYG7zYQz+7k8GTPS7PjD5Dn569eh4NvqB3DL7VxV08As3qvY34lL4btFW+lMGnPkx4rL2xCKi8FPm+PsXI8LwN+5y+BXWCvuXmQL72bOU71ROHPpplF77i52i8L9JCvVoE5T0YRLm9Et/fvNidkb1uRtO9fP6nvnzmfbzMghw+ibsXPqsAu7wRFXE91LKDPc0dxL6iFbo6fg26PW/hnT2+EQq7hZyWPdj7jr0hcbq+fdrTPT58+L2Nofi+ZZi6Pptd7j2Qv+g9tFlLPj8GED5ALpc+FJBpPrzDET7JiY0+YFHuvVm3JL7aN+49+9iDPUBsoj5CjNI8Nm/cvUw/n73If3c+gplRPWgHpz0jeSa9UEAOvmWE5L1Xbtg+fh45vrGUtr50dgo+aSrmvFb6eT4ugf495wyEPusFsb0K2p29OIGrPFLAXz563oe+51QLO/ot2j2H3ma8R8frvTn8fDy7eCC+6kNOPjPHMz47zKG8XVXWPU9utbt2tJU98sy5vKG/jDvkCos+QN77vTBNNj6FiQS8p1UUvj3zkL7zRXq+oG1evuxYWbxYE48+ijVgvQe1Zb1pqE+9oNBtPVeWiT0TEzY+cytaPuZLez6Qu9a+wSpVvQnifb194ru+Py1mvm4MO74/5c49eqYVPmSxKb54/7I9SxdJPsmwCz6hbqQ+H1Oyvd5ZzT5kyQM7l1Q5PmcScr4pASw+zjV9PvztUb79Uqk9fzPqPGy5fT4eu8c+OI9qPsIKtL16lL+923Q+Pq/SaT0j7zG++OE4vdlTgD2mUvE9tXcEvkkJrL6RA0C+iL8IvrhGmL1CcZM9/QJtPfBaFz7aIxg8rNcFvhaljj4PLHq+YmzGPXgRz717bu29KT6vvXUOvrwSdn092rmbPRT2LbrDapK8iXE5vuYrZ74+cpK9PJVUvqp/mL4A4zO+LK5MPiNK7bxhdEC+B+NdvvTMhj4yki09lqU5vsRtc73FuXe9dskvPjqcLj2HBDo9P28VPsZp1j3Oiq0+hWDFvVNC6b0uAGW+82aePU2Zur1ofG49imTUPa4KP76kXlq9UoIUvqsNML45/Ci9c91TviABQb496w09Vr0HviuGNb6gGQa9TMITveRjLL4PAZo84qSOPU007r2wZoW9UtWFvkAZyT2GRNI9A7IMvsCTer5KlwY9pArIvTL0XL62uCm8mLwtPThASDtr0sE8Vu55vlXN8r29RMc9+OoZvu/Z0D3sv9c9cAQRPQJEZb73yaM9Scyjvjqn8b3TVqk86sKRvVOZv72Liy0+ow5evRKbTL2bKIg9LGehPFljWb5qh3s8O/MOPp9qrb5hlK49FhlRvdBz2j0iRH090y4CvuKJQL4RBc+93Xa2PQhSRL6toW49pGQRPVyvYL5gLpw9PrK6vfawib4qAOu9KqkTvsDwezxemsG9ARQJvmM1kb1zYw2+ti2RvvhJ671OdF2+YlY+veTP5DphT0W+e74ovXPLh77vfmC+CesEvhnM6DxCroA9qbvyvVDKkjsJdFm9XYCYvRL4jr6SheC6DkxRPP+vJLxjZLK94cxNvS39Lr7pJGm+aXerPIxH1L1S9za+D4WBvcugDj0o8e68XSANvrsINzzG25s94WzMPUJ7Sb5UFSA9YqqAPaSoEL5S6Pe9R5o/vrDmrb4UNp2+oa7yPW9F972niWa+s9mEvunVxb3UGZA9/VMHvuLHHr1NnWy9pZFovpAVrL078+M9XxlxPctxyL3Hgtu9YKEwPEWfj72lryC+P0t+PQcvlz5bPny8NFbGPRdyAL7yULC+ex7+vDSjDL3UoaO9d88WPX0b1L3KhQU8SeksvvGZkb6W2v489jZRvRIEkb2qlxY8sb4/PmzoVb5TNaa9ylvgvf06nb0rwFm9j5OMvsxFNjxJ0j48PqJFPahIlj30FzO+PdpivgOptzwgMdU94xtmPWicFT007F+9BNOOvgoF9TwTPEs+Y9LZvFuGUD42REE8o+HHveyUPr4R4Ga8gg2ZPG8Tc72fRkK9ddQWPrrEyr7Gk0U+P2KgPpAxpb3h918++9h2vCd1aj40doY+H6AqPiGvhb7O56g9mXbYu4dwcb6ElrC91wY0PueDFL5uUDy9UWExvSz8mb6bhIC923r5vUq1W77xvuK+eJaUPkm9Rr4StJc90zekPbcH2Tlt+po9/LfHPcUIPL04SAQ9MZV4vZ92hD6HNuO8rjbRPbWLlTxC4E29FEgnPiQGab4sc6a9+kKSvdye9z0w1F89iIfWvarbCj69PA2+oOWLO/80ej1ixWW+IDOKPaUurr3qd9U9u/h5PfMvp710Ans+rtLXPbKQ7Dw9blW+IVmKvWSl9T2n6Lq9DTjgvdFEIj769Bq+RyhmPs1Dpz6K1Yw94n46PTRJEr5jV4W+RLrgvSbCBj2FcIE+8vY6viFflL7Tbh0+1vVTPtVQ/j3OESY+K6YHvn57lL3J9YU+1lskvnbfTj52JV26sX16vi0va765Qzc+1WDavJsMNj60hcO9Ltv9PR9MFT5iCyW+gY4APaCzh76eSIi+5y4fvn4NNz4+gxQ+hexYvb4eXT5TPEs92V1DPdI3Z77T3ju9p1mgPUvHmz2fjae8WRsGvmgLYj4daww+dIg+PbvJTT4VsCa81bi1Pqb3pj3A79S+seORvTFBaj5nvCe+zhY4vsoQCb5SvoY+xdhKvZJnurwRQus8blYQvSmCdT21kRA+LWGcvW3NvD0xMaA+1XUgvqjoCT5t938+F5CNvcEQNr4GeBc+G1SLvvSqOztBMN8+0p0Dvr6Bj74Dwbi9jbkqPqPFFT423ZS+ydTdPXZrlr3lx4W7DBnPvQq1d75ZsAM+6D9RvlEHVL6oHVC+eou2PWLebD5LoiY+sr85O6eP9L2pdjS+j1kQvQoWOz7QeKY9cWkGPgvi1D32rlC+CrguPdWvRT5D20a+cTNXPRcqYb2SWbu95k2GvRnSMb45BpM93EfjvU2tmT0IWA8+60oWPmIXiz4dTeO9/Qlyvl2MnjxoOaA7q4XRPNoVwT3+ckS9KIlbPrBHKz4TmDw+f5+qPOlmjL5IQK+7EiUGPqFpHD1ioEs8v0TvO3nWnb7ygps9gkF7OQAGWDxLKR28lECpPVZl5r0adn291nYgPVNaMT7c/SQ+lvjTvJG2RT0nAKY99YaKvQawxb0jUdw9M3NYupNRhL7CfQ2+8V0ePrvTB72zHVU+92KUvURIrD2kXpu9jTAavs3jCb5ov/E9BbzMPerPkD0GCvA9S4xcPlzFB74XL0m+8akSPky1Tj1PoS4+9AfruzWT5DsC75Y7+IMVvaz2Wj7tNRK+BeJBvlOJNL7fdRg8t4AXvSagAz6SN3A9dycHPcFIZb0CcEG9SiLhPfZaOz0Ltb88tiPLPbdeJT1MWyA+jto6PTAqbj7Kpew8onxsvWjydL7C0BO94e6MvU7L0b1KAxC80axLveZ4Pr1GkWm+o9unvfJY7r1itpq9Iuu0PSPpkz24Kga+slEMPSUfVb01e2K9tVMaPhBHWD48hpS8JkTnvV0wKL4vVBG+4f8JPoPjmr04Ye87VrrLPCAjDD5TW/s9ix8RPh3Zljz/Ikg9jmKYvK81fD4g7BW+PK7EvOP8ZLxEA0Y+GHXgvEHR8L3BcUU8CLQVPuSj5b36Knk9lRVmvhDDIT7nu8c7b2DjPK5lYrye6148454TPoef4b2WiQw+uhdDvapz3T2s0Oa9s0k4Pq2h1r2BOBu++QETvSFQNryLYfI9ioTGvVOakz1VCKm9MAOIu3zWm77WmAo9FE+fO/+yPr64snC+WglqPcqEgz4mN0E+utD1PrwEID0RXJy98NdnvuCIhL3BI5+921IivtxsXL4qQcY8SMgxvvcIe75tgw8/6xRmvKV4x75NMAG+yg+SPlUtsjvQXW693XstvOSM7j0mpD2+IzFeviK1Oby8xwC+DoKIPp3Epr6m4ku808FSvtKETT5Mtl2+9BwNvsh1xT31UXO71migPNyPVb7wgc88rTakPYF0kj64Mo49Q8oevlzbHr6nrW2+Yku8PpNZsbzvxhW++3kgPbrwpb16mp8+nwKcPv1Cwz7h/BM+LoE0vJhU3D3HekE+gYniPap6er6ORsK9S+xvPXmGtb1QSve9JymqPdmjnj0zYN28li/EPtRUp74IEXe+hZYpvstr1L1JxtC+LakBPm2rqL6jEUA+BuSxOxPoe77ttls+ZVuHvfrDkD1I1P45CA6svZyt9LwXyoi9/BEGP5CsSL5Nkxe+Sw+0PUDqRr5FdZA+o6UXvZnyoj5TXJk95lFqvlrDsD60dFc+Lq27PeLaBD66uKK9KGsKvWzmIT7Rzxo8FD3yPqRbyzuGw5Y9H7VlvS4XGTxlCZa+QF1WPSkKB71i8h4+Acr8PIWGbT6/2he+FE2xPLF9xj11TJi+V7eIvlWamb1VQWm+WfQ4uhOZgD4A5Rs+QFg2vkGSZL7IAQo+68ROvbssoD4XEqm77ybwPZw5UT7TfIW+q/HJvbjm671ZvrQ9FRwyvtxxNz7AgVs9lvRJvhLkPT7frlS+h+kUPjjOKj43yPM9t5c3PuYJT76Ytw6+pBFuuwRLu71htjU9H8UxPg5bRz6Povo9zx8HPumAaDtyPxW+70CZPkYD+Dy69Ui8pmzbPUQUUz4YJzc+1b4JvdqU7jzmuzI+2ErMPRnQVz7SjQw+APMYvqP6Tj0Slhe8U/+wPkByIr5JckI+ToYQPh1Bj71dyxa+2uJ4PrjplTvCXtw7z0j6vl2xVz6xMsE+sKQZvq0WpD4OHFK9pxCjPSj7Eb4ItFA9cNA+vv1r3bxd0a499Gz7PfppLT7WJkI+iwHbPa9ngT5QlIY+9A8+PrNclL5gszU+2aPaPfPb+b3KIMm+HZtmPrueu71EwGe+NTipvTITRj3LMwc9yEHTPkVvtL5VsxC+fURsPtWRaT19LDc+nlMXPSyUS72cbce9Jks5PjAGcb6fkSw+2QmAvbwcHDypMh8+LC7ivVm81j0eUtU9lyM1O3zeDb5mroI9E0QGPkxwxj7e3L4+9WdwPUU4PT7crVa+5N5xPSFXBTzNeEQ+fFqOPoeurLzuk5U+eFrHvAkirL00c6Q+Fo9gPJHWnjxiHs29Oqw0vlfoJr3bdck9KNToPXM7rD0HyXA8"}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/Conv2D/ReadVariableOp", "op": "Identity", "input": ["sequential_1/conv2d_2/Conv2D/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/Conv2D", "op": "Conv2D", "input": ["Func/PartitionedCall/output/_2", "sequential_1/conv2d_2/Conv2D/ReadVariableOp"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/BiasAdd/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}, "tensorContent": "lXFpvcr7CT2CE+i8TFI3veMG9DzaaC699VivvaGMqLtUnjG9frc9vXupCj5zjaG9617svU/shT15ihi+MexzvS2IhL3FkQ+8TJYOvMXAPzzPWlc9tLtlvY7t0ryvyxa9rBoovJm/Jjz5uLw9hupcvW8w4z29tyC9rd27vfmFp73Cr6y96M+6vMBN2T1HjEw9chjXOS8ABr7M5vC9K1Irve60lbwC57k9P9ZGvUfLYrxvmjq9aRhYvoG0F71JbNO94WC/PXVTZr2iNg49UYGJPYn84L3MOkm98aelOs0yUb2pjJy9LjrwvWcKJz1HGtO85qTRvHA9hz3bDQa+3vYNvTN557zb9gY9e8SDvE9M5L167gS9aOyluxayDL1GNms9iyEFvYcEAr40fJO9iO61vZiyKz14C+k8bm2NPKa2m7t3+ni9ij36u4sPorx300S9XkDHvYtKXjyS0Bq7P6t6vCT+Z73l7lc8OZ4cvOZKAD7aX488lAWoOyBgQj1lfrq9tbtxvBoBXj0NdJ09FTy5vaRaI71mIWi8lBMWPTzl9zwdoZq9QIG6vGeOAr55iFc8pwMwPUhJJj61c9a7kRvNPBBvOL2k9xC+tk4dPb75Z7xnnSI9yJGEvaqqFLoOT7I6dxYRvbSA7j1DizM9iSWGvXRcDT0g76+9ArqJveL7Gj0="}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/BiasAdd/ReadVariableOp", "op": "Identity", "input": ["sequential_1/conv2d_2/BiasAdd/ReadVariableOp/resource"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_2/BiasAdd", "op": "BiasAdd", "input": ["sequential_1/conv2d_2/Conv2D", "sequential_1/conv2d_2/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "sequential_1/conv2d_2/Relu", "op": "Relu", "input": ["sequential_1/conv2d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "sequential_1/conv2d_3/Conv2D/ReadVariableOp/resource", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "16"}]}, "tensorContent": 